src/DataProcessors/ГП_ПолучениеДанныхУниверситета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГП_ПолучениеДанныхУниверситета</Name>
			<Comment>// Гарант+</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбработки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураДанныхПриказовУниверситет</Name>
					<Comment>Служебный</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоллекцияТаблицИдентификаторовСвязей</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Соответствие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдПриемник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Проверка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеБГУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеУнивер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсправитьКод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриказОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КанцелярскаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Факультеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Студенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПриказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриказОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыПриказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПриказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПриказовОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КурсыОбцчения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КурсыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ГП_ПолучениеДанныхУниверситета/Ext/ManagerModule.bsl
// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ ++ {
#Область ПрограммныйИнтерфейс

Функция ЗаполнитьТаблицыИндексовСвязей(КоллекцияТаблицИдентификаторовСвязей, Знач СтруктураДанныхСообщенияУниверситет) Экспорт
    // ТаблицаИндексовСвязей.Очистить();
КонецФункции

Функция ЗаполнитьДанныеИзУниверситет(Знач Объект, Знач ДанныеЗагрузки) Экспорт
    ОрганизацияПоУмолчанию = ГП_ОбменУниверситетБГУ.ПолучитьОрганизациюПоУмолчанию();

    Объект.Приказы.Очистить();
    Объект.Факультеты.Очистить();
    Объект.Студенты.Очистить();

    Объект.КоллекцияТаблицИдентификаторовСвязей = НовыйКоллекцияТаблицИдентификаторовСвязей();

    Для Каждого СтрокаДанныхПриказов Из ДанныеЗагрузки.Приказы Цикл
        НоваяСтрокаПриказа = Объект.Приказы.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрокаПриказа, СтрокаДанныхПриказов);

        НоваяСтрокаПриказа.Организация = ОрганизацияПоУмолчанию;
        НоваяСтрокаПриказа.НомерПриказа = СтрокаДанныхПриказов.НомерПриказа;
        НоваяСтрокаПриказа.Идентификатор = СтрокаДанныхПриказов.УникальныйИдентификатор;
        НоваяСтрокаПриказа.Представление = СтрокаДанныхПриказов.ПредставлениеСсылки;

        Для Каждого ЭлементКЗ Из Объект.КоллекцияТаблицИдентификаторовСвязей Цикл
            Если НЕ СтрокаДанныхПриказов.Свойство(ЭлементКЗ.Ключ) Тогда
                Продолжить;
            КонецЕсли;

            МассивИдентификаторовПриказа = СтрокаДанныхПриказов[ЭлементКЗ.Ключ];
            ТаблицаИдентификации = Объект.КоллекцияТаблицИдентификаторовСвязей[ЭлементКЗ.Ключ];
            ЗаполняемыйМассивСвязей = ТаблицаИдентификации.Получить(НоваяСтрокаПриказа.Идентификатор);
            Если ЗаполняемыйМассивСвязей = Неопределено Тогда
                ЗаполняемыйМассивСвязей = Новый Массив;
                ТаблицаИдентификации.Вставить(НоваяСтрокаПриказа.Идентификатор, ЗаполняемыйМассивСвязей);
            КонецЕсли;
            Для Каждого ТекущийИдентификатор Из МассивИдентификаторовПриказа Цикл
                ЗаполняемыйМассивСвязей.Добавить(ТекущийИдентификатор);
            КонецЦикла;
        КонецЦикла;
    КонецЦикла;

    Для Каждого СтрокаДанных Из ДанныеЗагрузки.СвязанныеОбъекты.Факультеты Цикл
        НоваяСтрока = Объект.Факультеты.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);

        НоваяСтрока.Идентификатор = СтрокаДанных.УникальныйИдентификатор;
    КонецЦикла;

    Для Каждого СтрокаДанных Из ДанныеЗагрузки.СвязанныеОбъекты.ФизическиеЛицаСтуденты Цикл
        НоваяСтрока = Объект.Студенты.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);

        НоваяСтрока.Идентификатор = СтрокаДанных.УникальныйИдентификатор;
    КонецЦикла;

    Возврат Истина;
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
Функция НовыйТаблицаПриказы() Экспорт
    Объект = Обработки.ГП_ПолучениеДанныхУниверситета.Создать();
    Возврат Объект.Приказы.ВыгрузитьКолонки();
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
Функция НовыйТаблицаФакультеты() Экспорт
    Объект = Обработки.ГП_ПолучениеДанныхУниверситета.Создать();
    Возврат Объект.Факультеты.ВыгрузитьКолонки();
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
Функция НовыйТаблицаСтуденты() Экспорт
    Объект = Обработки.ГП_ПолучениеДанныхУниверситета.Создать();
    Возврат Объект.Студенты.ВыгрузитьКолонки();
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
Функция НовыйТаблицаТипыПриказов() Экспорт
    Объект = Обработки.ГП_ПолучениеДанныхУниверситета.Создать();
    Возврат Объект.ТипыПриказов.ВыгрузитьКолонки();
КонецФункции

// Возвращаемое значение:
//  - Структура
Функция НовыйКоллекцияТаблицИдентификаторовСвязей() Экспорт
    РезультатФункции = Новый Структура;

    МассивНаименованийТаблиц = Новый Массив;
    МассивНаименованийТаблиц.Добавить("Факультеты");
    МассивНаименованийТаблиц.Добавить("Студенты");
    МассивНаименованийТаблиц.Добавить("ТипыПриказов");
    МассивНаименованийТаблиц.Добавить("КурсыОбучения");
    МассивНаименованийТаблиц.Добавить("Специальности");
    МассивНаименованийТаблиц.Добавить("ОснованияПоступления");

    Для Каждого ИмяТаблицыКолонки Из МассивНаименованийТаблиц Цикл
        РезультатФункции.Вставить(ИмяТаблицыКолонки, НовыйТаблицаИдентификаторовСвязей());
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
//      * ИдентификаторИсточникаСвязи - Строка
//      * ИдентификаторОбъектаСвязи - Строка
Функция НовыйТаблицаИдентификаторовСвязей() Экспорт
    // РезультатФункции = Новый ТаблицаЗначений;
    // РезультатФункции.Колонки.Добавить("ИдентификаторИсточникаСвязи", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    // РезультатФункции.Колонки.Добавить("ИдентификаторОбъектаСвязи", ОбщегоНазначения.ОписаниеТипаСтрока(100));
    // РезультатФункции.Индексы.Добавить("ИдентификаторИсточникаСвязи");
    // Возврат РезультатФункции;

    РезультатФункции = Новый Соответствие;
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.04.2025 [F00227785] Обмен Университет-БГУ -- }
